soap_spring_cxf_wss4j/doc/inbound-2.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-478ae521-0724-4f6b-9b93-b8ab366522cf">
                <wsse:Username>admin</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">4vl8OFBqsLEsfKGN6CWnVt11iww=</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">0H+ohZ0vAss/Emwp1vkEhA==</wsse:Nonce>
                <wsu:Created>2014-06-29T11:16:42.567Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <ns2:say xmlns:ns2="http://soap_spring_cxf_wss4j.cxf.demo/">
            <arg0>world</arg0>
        </ns2:say>
    </soap:Body>
</soap:Envelope>